{
  "defaultAccounts": [
    { "email": "admin@foo.com", "password": "changeme", "role": "admin" },
    { "email": "john@foo.com", "password": "changeme" }
  ],

  "defaultData": [
    { "name": "Basket", "quantity": 3, "owner": "john@foo.com", "condition": "excellent" },
    { "name": "Bicycle", "quantity": 2, "owner": "john@foo.com", "condition": "poor" },
    { "name": "Banana", "quantity": 2, "owner": "admin@foo.com", "condition": "good" },
    { "name": "Boogie Board", "quantity": 2, "owner": "admin@foo.com", "condition": "excellent" }
  ],

  "defaultProfiles": [
    {
      "firstName": "John",
      "lastName": "Doe",
      "image": "images/profileImage.png",
      "status": "Undergraduate Student",
      "level": "Intermediate",
      "goals": "Strength",
      "styles": "Powerlifting",
      "owner": "john@foo.com"
    },
    {
      "firstName": "Jane",
      "lastName": "Smith",
      "image": "images/jane.png",
      "status": "Graduate Student",
      "level": "Advanced",
      "goals": "Cardio",
      "styles": "HIIT",
      "owner": "jane@foo.com"
    },
    {
      "firstName": "Alice",
      "lastName": "Johnson",
      "image": "images/alice.png",
      "status": "Faculty/Staff",
      "level": "Expert",
      "goals": "Weight Loss",
      "styles": "Aerobic Exercise",
      "owner": "alice@foo.com"
    },
    {
      "firstName": "Bob",
      "lastName": "Brown",
      "image": "images/bob.png",
      "status": "Undergraduate Student",
      "level": "Novice",
      "goals": "Exercise",
      "styles": "Calisthenics",
      "owner": "bob@foo.com"
    },
    {
      "firstName": "Carol",
      "lastName": "White",
      "image": "images/carol.png",
      "status": "Graduate Student",
      "level": "Beginner",
      "goals": "Strength",
      "styles": "Weight Lifting",
      "owner": "carol@foo.com"
    },
    {
      "firstName": "Dave",
      "lastName": "Green",
      "image": "images/dave.png",
      "status": "Faculty/Staff",
      "level": "Advanced",
      "goals": "Cardio",
      "styles": "Circuit Training",
      "owner": "dave@foo.com"
    },
    {
      "firstName": "Eva",
      "lastName": "Black",
      "image": "images/eva.png",
      "status": "Undergraduate Student",
      "level": "Expert",
      "goals": "Weight Loss",
      "styles": "Bodybuilding",
      "owner": "eva@foo.com"
    }
  ],
  "defaultGenerator": [
    {
      "name": "Treadmill Intervals",
      "category": "Cardio",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Start with a 5-minute warm-up jog, then alternate between 1 minute of sprinting and 2 minutes of walking for 20 minutes. Finish with a 5-minute cooldown walk."
    },
    {
      "name": "Stair Climber Challenge",
      "category": "Cardio",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Alternate between 2 minutes of stair climbing at a moderate pace and 1 minute of high-intensity climbing for 30 minutes. Then, do 10 sets of 30-second sprints with 1-minute rest intervals."
    },
    {
      "name": "Elliptical Circuit",
      "category": "Cardio",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Start with 10 minutes on the elliptical at a moderate pace. Then, complete 3 rounds of: 10 minutes on the elliptical, 10 lunges (each leg), 10 push-ups, 10 squats, and 10 bicycle crunches. Finish with 10 minutes on the elliptical."
    },
    {
      "name": "Rowing Pyramid",
      "category": "Cardio",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Start with 5 minutes of rowing at a moderate pace. Then, do 1 minute at high intensity, 1 minute at moderate intensity, 2 minutes high, 2 minutes moderate, and continue up to 5 minutes high, then go back down the pyramid. Finish with a 5-minute cooldown."
    },
    {
      "name": "Cycle HIIT",
      "category": "Cardio",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Warm up for 5 minutes, then do 10 sets of 30-second sprints followed by 1 minute of recovery. Finish with a 5-minute cooldown."
    },
    {
      "name": "Jump Rope Circuit",
      "category": "Cardio",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Do 3 rounds of: 1 minute of jump rope, 20 mountain climbers, 20 jumping jacks, 10 burpees, and 10 push-ups. Rest for 1 minute between rounds."
    },
    {
      "name": "HIIT Treadmill",
      "category": "Cardio",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Warm up for 10 minutes. Then, alternate between 1 minute of sprinting and 2 minutes of jogging for 30 minutes. Finish with a 5-minute cooldown."
    },
    {
      "name": "Step Aerobics",
      "category": "Cardio",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Follow along with a step aerobics routine for 60 minutes, including combinations of steps, kicks, and arm movements to keep your heart rate up."
    },
    {
      "name": "Stationary Bike Challenge",
      "category": "Cardio",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Start with a 10-minute warm-up. Then, alternate between 3 minutes of moderate cycling and 2 minutes of high-intensity cycling for 30 minutes. Finish with a 5-minute cooldown."
    },
    {
      "name": "Sled Push and Pull",
      "category": "Cardio",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Push a sled for 25 yards, then immediately pull it back to the starting position. Repeat for 15 minutes. Then, do 10 rounds of 30 seconds of sled pushes followed by 30 seconds of rest."
    },
    {
      "name": "Quick Cardio Blast",
      "category": "Cardio",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Start with 3 minutes of brisk walking or jogging to warm up. Then, do 1 minute of high knees, 1 minute of jumping jacks, and 1 minute of burpees. Repeat this circuit 3 times. Finish with a 2-minute cooldown walk."
    },
    {
      "name": "Outdoor Circuit",
      "category": "Strength",
      "image": "images/level3.png",
      "time": "15 minutes",
      "description": "Perform each exercise for 1 minute, then rest for 30 seconds before moving to the next exercise. Repeat the circuit 3 times. 1. Push-ups - 10 reps 2. Bodyweight squats - 15 reps 3. Lunges - 10 reps each leg 4. Pull-ups or inverted rows - 8 reps 5. Plank - Hold for 1 minute."
    },
    {
      "name": "Full Body HIIT",
      "category": "Strength",
      "image": "images/level2.png",
      "time": "15 minutes",
      "description": "Perform each exercise for 45 seconds, then rest for 15 seconds before moving to the next exercise. Repeat the circuit 3 times. 1. Burpees 2. Dumbbell Thrusters 3. Renegade Rows 4. Jumping Lunges 5. Russian Twists with Dumbbell"
    },
    {
      "name": "Gym Strength Blast",
      "category": "Strength",
      "image": "images/level3.png",
      "time": "30 minutes",
      "description": "Complete 3 sets of each exercise with 10-12 reps per set. Rest for 1 minute between sets. 1. Barbell Squats 2. Deadlifts 3. Bench Press 4. Bent-over Rows 5. Overhead Press"
    },
    {
      "name": "Leg Day Burnout",
      "category": "Strength",
      "image": "images/level4.png",
      "time": "30 minutes",
      "description": "Perform 4 sets of each exercise with 12-15 reps per set. Rest for 1 minute between sets. 1. Leg Press 2. Romanian Deadlifts 3. Leg Extensions 4. Walking Lunges with Dumbbells 5. Calf Raises"
    },
    {
      "name": "Outdoor Strength Challenge",
      "category": "Strength",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Complete 5 rounds of the following circuit. Rest for 2 minutes between rounds. 1. Push-ups - 15 reps 2. Pull-ups or Chin-ups - 10 reps 3. Dips - 15 reps 4. Jump Squats - 20 reps 5. Plank - Hold for 1 minute"
    },
    {
      "name": "Total Body Pump",
      "category": "Strength",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Perform each exercise for 3 sets with 10-12 reps per set. Rest for 1 minute between sets. 1. Barbell Squats 2. Dumbbell Bench Press 3. Pull-ups or Lat Pulldowns 4. Lunges with Dumbbells 5. Tricep Dips"
    },
    {
      "name": "Gym Strength Endurance",
      "category": "Strength",
      "image": "images/level3.png",
      "time": "60 minutes",
      "description": "Complete 4 sets of each exercise with 15-20 reps per set. Rest for 1-2 minutes between sets. 1. Leg Press 2. Chest Press Machine 3. Lat Pulldown Machine 4. Leg Curl Machine 5. Cable Rows"
    },
    {
      "name": "Outdoor Full Body Burn",
      "category": "Strength",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Perform each exercise for 1 minute, then rest for 30 seconds before moving to the next exercise. Repeat the circuit 5 times. 1. Push-ups 2. Jump Squats 3. Bent-over Rows with Dumbbells 4. Walking Lunges with Dumbbells 5. Plank"
    },
    {
      "name": "Strength and Cardio Combo",
      "category": "Strength",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Alternate between strength exercises and cardio intervals. Perform 3 sets of each strength exercise with 12-15 reps per set. For cardio, perform 5 minutes of high-intensity intervals between strength sets. 1. Barbell Deadlifts 2. Jumping Jacks 3. Dumbbell Shoulder Press 4. Mountain Climbers 5. Bent-over Rows"
    },
    {
      "name": "Gym Machine Circuit",
      "category": "Strength",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Move from one machine to the next without resting. Complete 3 sets of 12-15 reps on each machine. Rest for 1 minute between sets. 1. Leg Press Machine 2. Chest Press Machine 3. Seated Row Machine 4. Leg Curl Machine 5. Shoulder Press Machine"
    },
    {
      "name": "Morning Stretch Routine",
      "category": "Flexibility",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Start with a standing forward bend for 30 seconds, then move into a downward dog pose for 1 minute. Next, do a seated forward bend for 45 seconds. Repeat these exercises for a total of 15 minutes."
    },
    {
      "name": "Full Body Stretch",
      "category": "Flexibility",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Begin with neck stretches, side stretches, and arm circles. Move on to hamstring stretches, quadriceps stretches, and calf stretches. Finish with a spinal twist and a deep breathing exercise. Repeat for a total of 15 minutes."
    },
    {
      "name": "Gym Stretch Routine",
      "category": "Flexibility",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Start with a 5-minute warm-up on the elliptical machine. Then, perform dynamic stretches such as leg swings, arm swings, and torso twists for 10 minutes. Follow with static stretches targeting major muscle groups for 15 minutes. Finish with a cooldown on the elliptical machine for 5 minutes."
    },
    {
      "name": "Evening Yoga Flow",
      "category": "Flexibility",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Begin with sun salutations to warm up the body. Move through a series of standing and seated poses including warrior, triangle, and pigeon pose. Focus on deep breathing and relaxation. Finish with a 5-minute savasana."
    },
    {
      "name": "Flexibility Circuit Training",
      "category": "Flexibility",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Perform a circuit of dynamic stretches such as high knees, butt kicks, leg swings, and arm circles for 20 minutes. Follow with static stretches targeting all major muscle groups for 20 minutes. Finish with 5 minutes of foam rolling."
    },
    {
      "name": "Stretching for Runners",
      "category": "Flexibility",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Start with a 10-minute warm-up jog. Then, perform dynamic stretches including leg swings, hip circles, and lunges for 20 minutes. Follow with static stretches focusing on calves, hamstrings, quads, and glutes for 20 minutes."
    },
    {
      "name": "Deep Stretch Yoga",
      "category": "Flexibility",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Begin with gentle warm-up poses like cat-cow and child's pose. Move through a series of deep stretches including seated forward bends, pigeon pose, and seated spinal twists. Hold each pose for 1-2 minutes. Finish with a 10-minute savasana."
    },
    {
      "name": "Power Stretch",
      "category": "Flexibility",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Start with a 10-minute warm-up on the elliptical machine. Then, perform dynamic stretches such as leg swings, arm circles, and torso twists for 20 minutes. Follow with a series of yoga poses including downward dog, warrior, and bridge pose. Hold each pose for 30 seconds to 1 minute. Finish with a cooldown on the elliptical machine for 10 minutes."
    },
    {
      "name": "Total Body Flexibility Workout",
      "category": "Flexibility",
      "image": "images/level3.png",
      "time": "60 minutes",
      "description": "Begin with a 10-minute warm-up of light cardio. Then, move through a series of dynamic stretches targeting the upper body, lower body, and core for 30 minutes. Follow with 20 minutes of static stretches holding each stretch for 30-60 seconds. Finish with 10 minutes of foam rolling."
    },
    {
      "name": "Yin Yoga for Relaxation",
      "category": "Flexibility",
      "image": "images/level3.png",
      "time": "60 minutes",
      "description": "Start with deep breathing exercises to calm the mind. Move through a series of yin yoga poses including butterfly, dragon, and sleeping swan. Hold each pose for 3-5 minutes, focusing on relaxation and releasing tension. Finish with a 10-minute guided meditation."
    },
    {
      "name": "Morning Mobility Routine",
      "category": "Warm-Up",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Start with 30 seconds of arm circles, then do 10 bodyweight squats. Follow with 10 lunges on each leg and 20 seconds of jumping jacks. Repeat this circuit for 15 minutes."
    },
    {
      "name": "Dynamic Stretching Warm-Up",
      "category": "Warm-Up",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Begin with 10 leg swings on each leg, then do 10 hip circles. Next, perform 10 arm swings and 10 shoulder circles. Repeat these exercises for 15 minutes."
    },
    {
      "name": "Gym Equipment Warm-Up",
      "category": "Warm-Up",
      "image": "images/level3.png",
      "time": "30 minutes",
      "description": "Start with a 5-minute brisk walk on the treadmill, then do 10 minutes of cycling. Follow with 10 minutes on the elliptical machine. Finish with 5 minutes of dynamic stretching."
    },
    {
      "name": "Full Body Warm-Up Circuit",
      "category": "Warm-Up",
      "image": "images/level3.png",
      "time": "30 minutes",
      "description": "Perform 10 bodyweight squats, 10 push-ups, and 10 lunges on each leg. Then, do 20 seconds of high knees and 20 seconds of butt kicks. Repeat this circuit for 30 minutes."
    },
    {
      "name": "Outdoor Jogging Warm-Up",
      "category": "Warm-Up",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Start with a 10-minute jog at an easy pace. Then, perform dynamic stretches including leg swings, arm circles, and torso twists for 15 minutes. Follow with a 15-minute brisk walk."
    },
    {
      "name": "Pre-Workout Stretching Routine",
      "category": "Warm-Up",
      "image": "images/level4.png",
      "time": "45 minutes",
      "description": "Begin with 10 minutes of light cardio such as jumping jacks or jogging in place. Then, do 10 minutes of dynamic stretches focusing on major muscle groups. Finish with 25 minutes of foam rolling and static stretching."
    },
    {
      "name": "Dynamic Warm-Up for Runners",
      "category": "Warm-Up",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Start with a 10-minute jog at an easy pace. Then, perform leg swings, walking lunges, and high knees for 20 minutes. Follow with 20 minutes of foam rolling and mobility exercises. Finish with a 10-minute cool-down jog."
    },
    {
      "name": "Gym Warm-Up Routine",
      "category": "Warm-Up",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Begin with 10 minutes on the treadmill at a moderate pace. Then, do 15 minutes of dynamic stretching including arm swings, leg swings, and hip circles. Follow with 20 minutes of light resistance training focusing on major muscle groups. Finish with 15 minutes of cooldown and static stretching."
    },
    {
      "name": "Outdoor Circuit Warm-Up",
      "category": "Warm-Up",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Perform a circuit of exercises including jogging, jumping jacks, bodyweight squats, lunges, and push-ups. Do each exercise for 1 minute with 30 seconds rest in between. Repeat the circuit for 60 minutes."
    },
    {
      "name": "Total Body Activation Warm-Up",
      "category": "Warm-Up",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Start with 10 minutes of brisk walking or jogging. Then, do dynamic stretches such as arm swings, leg swings, and trunk twists for 20 minutes. Follow with 20 minutes of foam rolling and mobility exercises targeting all major muscle groups. Finish with a 10-minute cool-down jog."
    },
    {
      "name": "Upper Body Circuit",
      "category": "Upper Body",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Perform 10 reps of bench press, followed by 10 reps of bent-over rows. Then, do 10 reps of shoulder presses and 10 reps of bicep curls. Repeat this circuit for 15 minutes."
    },
    {
      "name": "Quick Upper Body Blast",
      "category": "Upper Body",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Start with 10 push-ups, then do 10 tricep dips on a bench. Follow with 10 lateral raises and 10 front raises. Repeat for 15 minutes."
    },
    {
      "name": "Upper Body Strength",
      "category": "Upper Body",
      "image": "images/level3.png",
      "time": "30 minutes",
      "description": "Perform 3 sets of 10 reps each of lat pulldowns, chest flies, and overhead tricep extensions. Follow with 3 sets of 10 reps of bicep curls and shoulder shrugs. Rest 1 minute between sets."
    },
    {
      "name": "Upper Body Burn",
      "category": "Upper Body",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Start with 10 reps of barbell bench press, then do 10 reps of seated rows. Follow with 10 reps of military press and 10 reps of hammer curls. Repeat for 30 minutes."
    },
    {
      "name": "Upper Body Pump",
      "category": "Upper Body",
      "image": "images/level2.png",
      "time": "45 minutes",
      "description": "Perform 4 sets of 12 reps each of incline dumbbell press, cable rows, and lateral raises. Follow with 4 sets of 12 reps each of tricep pushdowns and bicep curls. Rest 1 minute between sets."
    },
    {
      "name": "Upper Body Strength and Conditioning",
      "category": "Upper Body",
      "image": "images/level2.png",
      "time": "45 minutes",
      "description": "Start with 5 minutes of rowing machine warm-up. Then, perform 3 sets of 12 reps each of bench press, pull-ups, and shoulder press. Follow with 3 sets of 12 reps each of tricep dips and bicep curls. Finish with 5 minutes of battle ropes."
    },
    {
      "name": "Upper Body Blast",
      "category": "Upper Body",
      "image": "images/level3.png",
      "time": "60 minutes",
      "description": "Perform 5 sets of 10 reps each of barbell bench press, lat pulldowns, and military press. Follow with 5 sets of 10 reps each of dumbbell rows, lateral raises, and tricep pushdowns. Rest 1-2 minutes between sets."
    },
    {
      "name": "Full Upper Body Workout",
      "category": "Upper Body",
      "image": "images/level3.png",
      "time": "60 minutes",
      "description": "Start with 10 minutes of warm-up on the elliptical machine. Then, perform 4 sets of 12 reps each of chest press, bent-over rows, and shoulder press. Follow with 4 sets of 12 reps each of bicep curls and tricep extensions. Finish with 10 minutes of cooldown and stretching."
    },
    {
      "name": "Upper Body Strength and Endurance",
      "category": "Upper Body",
      "image": "images/level3.png",
      "time": "60 minutes",
      "description": "Perform 5 sets of 10 reps each of incline bench press, seated cable rows, and Arnold press. Follow with 5 sets of 10 reps each of preacher curls and tricep kickbacks. Finish with 20 minutes of rowing machine cardio."
    },
    {
      "name": "Upper Body Superset Challenge",
      "category": "Upper Body",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Superset bench press with bent-over rows for 4 sets of 12 reps each. Then, superset shoulder press with pull-ups for 4 sets of 12 reps each. Follow with superset tricep pushdowns with bicep curls for 4 sets of 12 reps each. Rest 1-2 minutes between supersets."
    },
    {
      "name": "Lower Body Burn",
      "category": "Lower Body",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Perform 10 reps of squats with a barbell, followed by 10 reps of leg press. Then, do 10 reps of lunges on each leg and 10 reps of calf raises. Repeat this circuit for 15 minutes."
    },
    {
      "name": "Quick Lower Body Blast",
      "category": "Lower Body",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Start with 10 reps of goblet squats, then do 10 reps of Romanian deadlifts. Follow with 10 reps of leg curls and 10 reps of leg extensions. Repeat for 15 minutes."
    },
    {
      "name": "Leg Day Strength",
      "category": "Lower Body",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Perform 3 sets of 12 reps each of barbell squats, leg press, and Romanian deadlifts. Follow with 3 sets of 12 reps each of leg curls and calf raises. Rest 1 minute between sets."
    },
    {
      "name": "Lower Body Pump",
      "category": "Lower Body",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Start with 10 reps of hack squats, then do 10 reps of seated leg curls. Follow with 10 reps of standing calf raises and 10 reps of seated calf raises. Repeat for 30 minutes."
    },
    {
      "name": "Lower Body Strength and Stability",
      "category": "Lower Body",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Perform 4 sets of 12 reps each of front squats, walking lunges, and hamstring curls. Follow with 4 sets of 12 reps each of calf raises and step-ups. Rest 1 minute between sets."
    },
    {
      "name": "Lower Body Sculpt",
      "category": "Lower Body",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Start with 10 reps of barbell hip thrusts, then do 10 reps of Bulgarian split squats on each leg. Follow with 10 reps of seated leg extensions and 10 reps of standing calf raises. Repeat for 45 minutes."
    },
    {
      "name": "Leg Day Intensity",
      "category": "Lower Body",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Perform 5 sets of 10 reps each of squats, deadlifts, and lunges on each leg. Follow with 5 sets of 10 reps each of leg curls and calf raises. Rest 1-2 minutes between sets."
    },
    {
      "name": "Complete Lower Body Workout",
      "category": "Lower Body",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Start with 10 minutes of warm-up on the elliptical machine. Then, perform 4 sets of 12 reps each of leg press, leg extensions, and Romanian deadlifts. Follow with 4 sets of 12 reps each of calf raises and walking lunges. Finish with 10 minutes of cooldown and stretching."
    },
    {
      "name": "Lower Body Strength and Power",
      "category": "Lower Body",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Perform 5 sets of 8 reps each of back squats, box jumps, and deadlifts. Follow with 5 sets of 10 reps each of leg curls and calf raises. Rest 1-2 minutes between sets."
    },
    {
      "name": "Leg Day Superset Challenge",
      "category": "Lower Body",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Superset barbell squats with Romanian deadlifts for 4 sets of 12 reps each. Then, superset leg press with calf raises for 4 sets of 12 reps each. Follow with superset walking lunges with leg curls for 4 sets of 12 reps each. Rest 1-2 minutes between supersets."
    },
    {
      "name": "Core Burn",
      "category": "Abs",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Perform 10 reps of cable crunches, followed by 10 reps of Russian twists. Then, do 10 reps of leg raises and 10 reps of bicycle crunches. Repeat this circuit for 15 minutes."
    },
    {
      "name": "Quick Core Blast",
      "category": "Abs",
      "image": "images/level1.png",
      "time": "15 minutes",
      "description": "Start with 10 reps of Swiss ball crunches, then do 10 reps of plank twists. Follow with 10 reps of reverse crunches and 10 reps of mountain climbers. Repeat for 15 minutes."
    },
    {
      "name": "Abdominal Strength",
      "category": "Abs",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Perform 3 sets of 15 reps each of weighted sit-ups, followed by 3 sets of 15 reps each of cable woodchoppers. Then, do 3 sets of 15 reps each of hanging leg raises and Russian twists. Rest 1 minute between sets."
    },
    {
      "name": "Core Crusher",
      "category": "Abs",
      "image": "images/level2.png",
      "time": "30 minutes",
      "description": "Start with 15 reps of decline sit-ups, then do 15 reps of cable oblique twists. Follow with 15 reps of hanging knee raises and 15 reps of seated leg tucks. Repeat for 30 minutes."
    },
    {
      "name": "Abs and Obliques Sculpt",
      "category": "Abs",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Perform 4 sets of 20 reps each of decline crunches, followed by 4 sets of 20 reps each of side plank dips on each side. Then, do 4 sets of 20 reps each of Russian twists and hanging windshield wipers. Rest 1 minute between sets."
    },
    {
      "name": "Core Strength and Stability",
      "category": "Abs",
      "image": "images/level3.png",
      "time": "45 minutes",
      "description": "Start with 20 reps of stability ball rollouts, then do 20 reps of cable rope crunches. Follow with 20 reps of weighted side bends on each side and 20 reps of jackknife sit-ups. Repeat for 45 minutes."
    },
    {
      "name": "Abs Circuit Challenge",
      "category": "Abs",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Perform 5 sets of 15 reps each of hanging leg raises, followed by 5 sets of 15 reps each of weighted Swiss ball crunches. Then, do 5 sets of 15 reps each of cable twists and mountain climbers. Rest 1-2 minutes between sets."
    },
    {
      "name": "Complete Ab Workout",
      "category": "Abs",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Start with 10 minutes of warm-up on the elliptical machine. Then, perform 4 sets of 20 reps each of weighted decline sit-ups, followed by 4 sets of 20 reps each of cable woodchoppers. Follow with 4 sets of 20 reps each of hanging leg raises and Russian twists. Finish with 10 minutes of cooldown and stretching."
    },
    {
      "name": "Abs and Core Strength",
      "category": "Abs",
      "image": "images/level4.png",
      "time": "60 minutes",
      "description": "Perform 5 sets of 15 reps each of weighted crunches, followed by 5 sets of 15 reps each of side plank raises on each side. Then, do 5 sets of 15 reps each of reverse crunches and oblique cable twists. Rest 1-2 minutes between sets."
    },
    {
      "name": "Ab Superset Challenge",
      "category": "Abs",
      "image": "images/level5.png",
      "time": "60 minutes",
      "description": "Superset Swiss ball crunches with Russian twists for 4 sets of 20 reps each. Then, superset hanging leg raises with cable rope crunches for 4 sets of 20 reps each. Follow with superset plank hold with bicycle crunches for 4 sets of 20 reps each. Rest 1-2 minutes between supersets."
    }
  ],
  "defaultItems": [
    {
      "itemName": "Elliptical Machine",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/elliptical.jpeg",
      "description": "An elliptical machine provides a low-impact cardiovascular workout while engaging both the upper and lower body."
    },
    {
      "itemName": "Stationary Bicycle",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/stationbike.jpeg",
      "description": "Stationary bikes offer a seated cardiovascular workout primarily targeting the lower body muscles."
    },
    {
      "itemName": "Rowing Machine",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/rowing.jpeg",
      "description": "A rowing machine provides a full-body cardiovascular workout while emphasizing the muscles in the back, arms, and legs."
    },
    {
      "itemName": "Stair Climber",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/stair.jpeg",
      "description": "The stair climber simulates climbing stairs and provides an intense lower body workout while also engaging the cardiovascular system."
    },
    {
      "itemName": "Leg Press Machine",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/legpress.jpeg",
      "description": "The leg press machine targets the muscles of the lower body, including the quadriceps, hamstrings, and glutes."
    },
    {
      "itemName": "Chest Press Machine",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/chestpress.jpeg",
      "description": "The chest press machine is a strength training equipment that primarily targets the muscles of the chest (pectoralis major), shoulders (anterior deltoids), and triceps."
    },
    {
      "itemName": "Lat Pulldown Machine",
      "category": "Strength",
      "locationFound": "2nd Floor",
      "image": "images/lat.jpeg",
      "description": "The lat pulldown machine is designed to strengthen the muscles of the upper back, particularly the latissimus dorsi (lats), as well as the biceps and forearms."
    },
    {
      "itemName": "Cable Crossover Machine",
      "category": "Strength",
      "locationFound": "2nd Floor",
      "image": "images/cablecross.jpeg",
      "description": "The cable crossover machine is a versatile piece of equipment for targeting various muscles in the upper body, including the chest, shoulders, and arms."
    },
    {
      "itemName": "Smith Machine",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/smith.jpeg",
      "description": "The Smith machine is a versatile piece of equipment that allows for a wide range of exercises targeting various muscle groups, including chest, shoulders, legs, and more."
    },
    {
      "itemName": "Basketball Court",
      "category": "Other",
      "locationFound": "1st Floor",
      "image": "images/basketball.jpeg",
      "description": "The basketball court is a sports surface designed for playing basketball, typically consisting of a rectangular floor with a hoop at each end."
    },
    {
      "itemName": "Indoor Track",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/indoor.jpeg",
      "description": "An indoor track is a circular or oval-shaped track located inside a building, used primarily for running and other track and field events."
    },
    {
      "itemName": "Treadmill",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/treadmill.jpeg",
      "description": "A treadmill is a cardio machine used for walking, running, or climbing while remaining in the same place."
    },
    {
      "itemName": "Dumbbells",
      "category": "Strength",
      "locationFound": "2nd Floor",
      "image": "images/dumbells.jpeg",
      "description": "Dumbbells are free weights used in strength training, typically consisting of a handle with weights attached at each end."
    },
    {
      "itemName": "Yoga Mats",
      "category": "Other",
      "locationFound": "1st Floor",
      "image": "images/yoga.jpeg",
      "description": "Yoga mats are used for yoga, Pilates, and other floor exercises to provide cushioning and traction."
    },
    {
      "itemName": "Bench Press",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/bench.jpeg",
      "description": "The bench press is a strength training exercise that works the chest, shoulders, and triceps using a barbell or dumbbells."
    },
    {
      "itemName": "Yoga Blocks",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/block.jpeg",
      "description": "Yoga blocks are used to provide support and stability in yoga poses, helping to improve flexibility and alignment."
    },
    {
      "itemName": "Foam Roller",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/foam.jpeg",
      "description": "A foam roller is a self-massage tool used to release muscle tightness and improve flexibility and range of motion."
    },
    {
      "itemName": "Stretching Strap",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/stretch.jpeg",
      "description": "A stretching strap is used to assist in stretching exercises, helping to increase flexibility and improve range of motion."
    },
    {
      "itemName": "Pilates Ring",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/pilates.jpeg",
      "description": "A Pilates ring, also known as a magic circle, is a flexible ring used in Pilates exercises to add resistance and improve flexibility and muscle tone."
    },
    {
      "itemName": "Balance Ball",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/balance.jpeg",
      "description": "A balance ball, also known as a stability ball, is used for stability, balance, and flexibility exercises to improve core strength and posture."
    },
    {
      "itemName": "Resistance Bands",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/resistance.jpeg",
      "description": "Resistance bands are elastic bands used for stretching, strengthening, and flexibility exercises to target various muscle groups."
    },
    {
      "itemName": "Kettlebells",
      "category": "Strength",
      "locationFound": "2nd Floor",
      "image": "images/kettle.jpeg",
      "description": "Kettlebells are cast iron weights with a handle used for ballistic exercises that combine cardiovascular, strength, and flexibility training."
    },
    {
      "itemName": "Battle Ropes",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/rope.jpeg",
      "description": "Battle ropes are thick, heavy ropes that are anchored and used in high-intensity interval training (HIIT) and other workouts to improve cardiovascular endurance and strength."
    },
    {
      "itemName": "Boxing Punching Bag",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/punch.jpeg",
      "description": "A boxing punching bag is used for cardiovascular workouts, endurance training, and improving boxing or martial arts techniques."
    },
    {
      "itemName": "Medicine Balls",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/med.jpeg",
      "description": "Medicine balls are weighted balls used for strength training, plyometrics, and rehabilitation exercises, improving core strength, coordination, and explosive power."
    },
    {
      "itemName": "TRX Suspension Trainer",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/trx.jpeg",
      "description": "The TRX suspension trainer uses gravity and bodyweight exercises to develop strength, balance, flexibility, and core stability."
    },
    {
      "itemName": "Jump Rope",
      "category": "Cardio",
      "locationFound": "1st Floor",
      "image": "images/jump.jpeg",
      "description": "A jump rope is a simple and effective cardio tool for improving coordination, agility, and cardiovascular health."
    },
    {
      "itemName": "Plyometric Box",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/plyo.jpeg",
      "description": "A plyometric box is used for plyometric exercises, such as box jumps and step-ups, to improve power, speed, and explosiveness."
    },
    {
      "itemName": "Sled Push",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/sled.jpeg",
      "description": "A sled push is a functional strength training exercise where the user pushes a weighted sled to develop lower body strength, power, and endurance."
    },
    {
      "itemName": "Glider Discs",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/slide.jpeg",
      "description": "Glider discs are used to perform exercises that engage multiple muscle groups, improve stability, and enhance flexibility, particularly in core and lower body muscles."
    },
    {
      "itemName": "Agility Ladder",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/lad.jpeg",
      "description": "An agility ladder is used for footwork drills and agility training, improving coordination, speed, and agility for athletes and fitness enthusiasts."
    },
    {
      "itemName": "Ab Roller Wheel",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/roll.jpeg",
      "description": "An ab roller wheel is a compact fitness tool used for core strengthening exercises, targeting the abdominals, obliques, and lower back muscles."
    },
    {
      "itemName": "Resistance Loop Bands",
      "category": "Flexibility",
      "locationFound": "1st Floor",
      "image": "images/loop.jpeg",
      "description": "Resistance loop bands are small, portable bands used for strength training, rehabilitation, and flexibility exercises to target specific muscle groups."
    },
    {
      "itemName": "Power Tower",
      "category": "Strength",
      "locationFound": "2nd Floor",
      "image": "images/tow.jpeg",
      "description": "A power tower is a multi-functional piece of equipment for bodyweight exercises like pull-ups, dips, and leg raises, targeting various muscle groups."
    },
    {
      "itemName": "Squat Rack",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/squat.jpeg",
      "description": "A squat rack is used for performing squats, bench presses, and other barbell exercises, providing safety and stability during heavy lifting."
    },
    {
      "itemName": "Landmine Attachment",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/land.jpeg",
      "description": "A landmine attachment is a versatile tool for performing rotational exercises, presses, and rows, adding variety to strength training workouts."
    },
    {
      "itemName": "Assault Bike",
      "category": "Cardio",
      "locationFound": "2nd Floor",
      "image": "images/bik.jpeg",
      "description": "An assault bike is a stationary exercise bike with fan blades for resistance, providing a high-intensity cardiovascular workout for both upper and lower body."
    },
    {
      "itemName": "Glute-Ham Developer",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/glute.jpeg",
      "description": "A glute-ham developer is used for strengthening the posterior chain muscles, including the glutes, hamstrings, and lower back."
    },
    {
      "itemName": "Agility Cone Set",
      "category": "Other",
      "locationFound": "1st Floor",
      "image": "images/cone.jpeg",
      "description": "An agility cone set is used for agility drills, speed training, and footwork exercises to improve athletic performance and coordination."
    },
    {
      "itemName": "Leg Extension Machine",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/leg.jpeg",
      "description": "The leg extension machine isolates and strengthens the quadriceps muscles through controlled leg extension movements."
    },
    {
      "itemName": "Seated Leg Curl Machine",
      "category": "Strength",
      "locationFound": "1st Floor",
      "image": "images/curl.jpeg",
      "description": "The seated leg curl machine targets the hamstrings, promoting knee flexion against resistance for strength and muscle development."
    },
    {
      "itemName": "Tricep Rope Attachment",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/tri.jpeg",
      "description": "The tricep rope attachment is used for various tricep exercises on cable machines, targeting the muscles of the upper arm."
    },
    {
      "itemName": "Close Grip Row Handle",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/close.jpeg",
      "description": "The close grip row handle is designed for rowing exercises, focusing on the back muscles, including the latissimus dorsi and rhomboids."
    },
    {
      "itemName": "V-Bar Attachment",
      "category": "Other",
      "locationFound": "2nd Floor",
      "image": "images/v.jpeg",
      "description": "The V-bar attachment is commonly used for cable exercises like rows and pulldowns, targeting the back and arm muscles."
    },
    {
      "itemName": "Cable Ankle Strap",
      "category": "Other",
      "locationFound": "1st Floor",
      "image": "images/ankle.jpeg",
      "description": "The cable ankle strap attaches to cable machines for lower body exercises, such as leg lifts, hip abductions, and kickbacks."
    },
    {
      "itemName": "Basketball",
      "category": "Sports Equipment",
      "locationFound": "1st Floor",
      "image": "images/basket.jpeg",
      "description": "A basketball for playing basketball games on the court. Suitable for individual practice or team games."
    },
    {
      "itemName": "Soccer Ball",
      "category": "Sports Equipment",
      "locationFound": "1st Floor",
      "image": "images/soccer.jpeg",
      "description": "A soccer ball for playing soccer matches or practice. Suitable for both indoor and outdoor use."
    },
    {
      "itemName": "Volleyball",
      "category": "Sports Equipment",
      "locationFound": "1st Floor",
      "image": "images/volleyball.jpeg",
      "description": "A volleyball for playing volleyball games on the court. Suitable for casual games or competitive matches."
    }
  ],
  "defaultWorkouts": [
    {
      "date": "4/8/2024",
      "difficulty": 4,
      "highlight": "Hit 215 for 3 today on bench",
      "name": "Bench Day",
      "owner": "john@foo.com",
      "rating": 3
    },
    {
      "date": "4/6/2024",
      "difficulty": 5,
      "highlight": "Hit a new pr to on squat 395 for 3",
      "name": "Squat Day",
      "owner": "john@foo.com",
      "rating": 5
    },
    {
      "date": "4/2/2024",
      "difficulty": 4,
      "highlight": "Feeling more confident on deadlift hitting 435 for 4",
      "name": "Deadlift Day",
      "owner": "admin@foo.com",
      "rating": 4
    }
  ],
  "defaultPRS" : [
    {
      "date": "3/25/2024",
      "exercise": "Bench",
      "repsOrDist": "4 reps",
      "weight": 220,
      "owner": "john@foo.com"
    },
    {
      "date": "4/6/2024",
      "exercise": "Squat",
      "owner": "john@foo.com",
      "repsOrDist": "3 reps",
      "weight": 395
    },
    {
      "date": "3/25/2024",
      "exercise": "Deadlift",
      "repsOrDist": "4 reps",
      "weight": 455,
      "owner" : "admin@foo.com"
    }
  ]

}
